---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureDefinitionRegistry
source: html/d6d490f0-2d57-c6ac-2b11-321f86dcfd2e.htm
---
# FailureDefinitionRegistry Properties

Specifies whether the .NET object represents a valid Revit entity.